In [1]:
# conda activate p39-env
# conda install pandas

In [2]:
import pandas as pd

In [3]:
# 두가지 collection data type: series, dataframe

# Series

In [4]:
s1 = pd.Series([10, 20, 30, 40, 50])
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
print(s1.index)
print(s1.values) #numpy 배열 타입

RangeIndex(start=0, stop=5, step=1)
[10 20 30 40 50]

In [6]:
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3]) #numpy 배열과 달리 서로 다른 타입을 넣을 수 있음
print(s2)

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [8]:
n = s2.values
print(n.dtype) #서로 다른 type -> object 통일

object

In [9]:
import numpy as np

In [13]:
s3 = pd.Series([np.nan, 1, 2]) #null
print(s3)

0    NaN
1    1.0
2    2.0
dtype: float64

In [14]:
index_date = ['2023-06-01', '2023-06-02', '2023-06-03', '2023-06-04']
s4 = pd.Series([200, 187, np.nan, 210], index = index_date)
print(s4)

2023-06-01    200.0
2023-06-02    187.0
2023-06-03      NaN
2023-06-04    210.0
dtype: float64

In [15]:
s5 = pd.Series({'국어':100, '영어':95, '수학':100})
print(s5)

국어    100
영어     95
수학    100
dtype: int64

In [16]:
p = pd.date_range(start='2020-01-20', end='2020-01-27')
print(p)

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26', '2020-01-27'],
              dtype='datetime64[ns]', freq='D')

In [17]:
p = pd.date_range(start='2020/01/20', end='2020/01/27')
print(p)

DatetimeIndex(['2020-01-20', '2020-01-21', '2020-01-22', '2020-01-23',
               '2020-01-24', '2020-01-25', '2020-01-26', '2020-01-27'],
              dtype='datetime64[ns]', freq='D')

In [18]:
p = pd.date_range(start='2023-06-02', periods = 7)
print(p)

DatetimeIndex(['2023-06-02', '2023-06-03', '2023-06-04', '2023-06-05',
               '2023-06-06', '2023-06-07', '2023-06-08'],
              dtype='datetime64[ns]', freq='D')

In [19]:
# https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases
p = pd.date_range(start='2023-06-02', periods = 7, freq = '2D')
print(p)

DatetimeIndex(['2023-06-02', '2023-06-04', '2023-06-06', '2023-06-08',
               '2023-06-10', '2023-06-12', '2023-06-14'],
              dtype='datetime64[ns]', freq='2D')

In [20]:
p = pd.date_range(start='2023-06-02', periods = 5, freq = 'W')
print(p)

DatetimeIndex(['2023-06-04', '2023-06-11', '2023-06-18', '2023-06-25',
               '2023-07-02'],
              dtype='datetime64[ns]', freq='W-SUN')

In [21]:
p = pd.date_range(start='2023-06-02', periods = 5, freq = 'W-MON')
print(p)

DatetimeIndex(['2023-06-05', '2023-06-12', '2023-06-19', '2023-06-26',
               '2023-07-03'],
              dtype='datetime64[ns]', freq='W-MON')

In [22]:
p = pd.date_range(start='2023-06-02', periods = 5, freq = 'W-FRI')
print(p)

DatetimeIndex(['2023-06-02', '2023-06-09', '2023-06-16', '2023-06-23',
               '2023-06-30'],
              dtype='datetime64[ns]', freq='W-FRI')

In [23]:
p = pd.date_range(start='2023-01-03', periods=4, freq='QS')
print(p)

DatetimeIndex(['2023-04-01', '2023-07-01', '2023-10-01', '2024-01-01'], dtype='datetime64[ns]', freq='QS-JAN')

In [24]:
p = pd.date_range(start='2023-01-03', periods=4, freq='AS')
print(p)

DatetimeIndex(['2024-01-01', '2025-01-01', '2026-01-01', '2027-01-01'], dtype='datetime64[ns]', freq='AS-JAN')

In [25]:
p = pd.date_range(start='2023-06-01 08:00', periods=10, freq='H')
print(p)

DatetimeIndex(['2023-06-01 08:00:00', '2023-06-01 09:00:00',
               '2023-06-01 10:00:00', '2023-06-01 11:00:00',
               '2023-06-01 12:00:00', '2023-06-01 13:00:00',
               '2023-06-01 14:00:00', '2023-06-01 15:00:00',
               '2023-06-01 16:00:00', '2023-06-01 17:00:00'],
              dtype='datetime64[ns]', freq='H')

In [27]:
p = pd.date_range(start='2023-06-01 08:00', periods=10, freq='BH')
print(p)

DatetimeIndex(['2023-06-01 09:00:00', '2023-06-01 10:00:00',
               '2023-06-01 11:00:00', '2023-06-01 12:00:00',
               '2023-06-01 13:00:00', '2023-06-01 14:00:00',
               '2023-06-01 15:00:00', '2023-06-01 16:00:00',
               '2023-06-02 09:00:00', '2023-06-02 10:00:00'],
              dtype='datetime64[ns]', freq='BH')

In [30]:
cbh = pd.offsets.CustomBusinessHour(start='09:00', 
                                    end='18:00', 
                                    weekmask='Mon Tue Wed Thu Fri')

In [32]:
p = pd.date_range(start='2023-06-01 08:00', periods=10, freq=cbh)
print(p)

DatetimeIndex(['2023-06-01 09:00:00', '2023-06-01 10:00:00',
               '2023-06-01 11:00:00', '2023-06-01 12:00:00',
               '2023-06-01 13:00:00', '2023-06-01 14:00:00',
               '2023-06-01 15:00:00', '2023-06-01 16:00:00',
               '2023-06-01 17:00:00', '2023-06-02 09:00:00'],
              dtype='datetime64[ns]', freq='CBH')

In [33]:
p = pd.date_range(start='2020-01-01 10:00', periods=4, freq='30min')
print(p)

DatetimeIndex(['2020-01-01 10:00:00', '2020-01-01 10:30:00',
               '2020-01-01 11:00:00', '2020-01-01 11:30:00'],
              dtype='datetime64[ns]', freq='30T')

In [34]:
p = pd.date_range(start='2020-01-01 10:00:00', periods=4, freq='10S')
print(p)

DatetimeIndex(['2020-01-01 10:00:00', '2020-01-01 10:00:10',
               '2020-01-01 10:00:20', '2020-01-01 10:00:30'],
              dtype='datetime64[ns]', freq='10S')

In [37]:
index_date = pd.date_range(start = '2023-06-01', periods = 5, freq = 'D')
p = pd.Series([51, 63, 59, 48, 60], index = index_date)
print(p)

2023-06-01    51
2023-06-02    63
2023-06-03    59
2023-06-04    48
2023-06-05    60
Freq: D, dtype: int64

# Dataframe

In [38]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [41]:
data = np.array([[1,2,3], [4,5,6], [7,8,9]])
df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [42]:
data = np.array([[1,2,3], [4,5,6], [7,8,9]])
index_date = pd.date_range('2023-06-01', periods = 3)
column_list = ['A', 'B', 'C']
df = pd.DataFrame(data, index = index_date, columns = column_list)
print(df)

            A  B  C
2023-06-01  1  2  3
2023-06-02  4  5  6
2023-06-03  7  8  9

In [43]:
data = {'연도': [2015, 2016, 2016, 2017, 2017], '지사': ['서울', '서울', '부산', '서울', '부산'],
    '고객 수': [200, 250, 150, 300, 200]}
df = pd.DataFrame(data)
print(df)

     연도  지사  고객 수
0  2015  서울   200
1  2016  서울   250
2  2016  부산   150
3  2017  서울   300
4  2017  부산   200

In [45]:
data = {'연도': [2015, 2016, 2016, 2017, 2017], '지사': ['서울', '서울', '부산', '서울', '부산'],
        '고객 수': [200, 250, 150, 300, 200]}
df = pd.DataFrame(data, columns = ['지사', '연도', '고객 수'])
print(df)

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200

In [48]:
print(df.index)
print(df.columns)
print(df.values) #numpy 배열

RangeIndex(start=0, stop=5, step=1)
Index(['지사', '연도', '고객 수'], dtype='object')
[['서울' 2015 200]
 ['서울' 2016 250]
 ['부산' 2016 150]
 ['서울' 2017 300]
 ['부산' 2017 200]]

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   지사      5 non-null      object
 1   연도      5 non-null      int64
 2   고객 수    5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

# 연산

In [50]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([10, 20, 30, 40, 50])
print(s1 + s2) #element-wise
print(s2 - s1)
print(s1 * s2)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64
0     10
1     40
2     90
3    160
4    250
dtype: int64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [51]:
s1 = pd.Series([1, 2, 3, 4])
s2 = pd.Series([10, 20, 30, 40, 50])
print(s1 + s2)

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [5]:
data1 = {'A': [1, 2, 3, 4, 5],
         'B': [10, 20, 30, 40, 50],
         'C': [100, 200, 300, 400, 500]}
df1 = pd.DataFrame(data1)
print(df1)

data2 = {'A': [6, 7, 8],
         'B': [60, 70, 80],
         'C': [600, 700, 800]}

df2 = pd.DataFrame(data2)
print(df2)
print('='*20)
print(df1 + df2)

df_D = pd.concat([df1,df2])
print(df_D)

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800
====================
      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN
   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500
0  6  60  600
1  7  70  700
2  8  80  800

In [ ]:
table_data3 = {'봄':  [256.5, 264.3, 215.9, 223.2, 312.8],
              '여름': [770.6, 567.5, 599.8, 387.1, 446.2],
              '가을': [363.5, 231.2, 293.1, 247.7, 381.6],
              '겨울': [139.3, 59.9, 76.9, 109.1, 108.1]}
columns_list = ['봄', '여름', '가을', '겨울']
index_list = ['2012', '2013', '2014', '2015', '2016']
df3 = pd.DataFrame(table_data3, columns = columns_list, index = index_list)

In [ ]:
print(df3)

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [55]:
print(df3.mean()) # 계절별
print('='*30)
print(df3.std())  # 계절별
print('='*30)
print(df3.mean(axis=1)) # 연도별
print('='*30)
print(df3.std(axis=1)) # 연도별

봄     254.54
여름    554.24
가을    303.42
겨울     98.66
dtype: float64
==============================
봄      38.628267
여름    148.888895
가을     67.358496
겨울     30.925523
dtype: float64
==============================
2012    382.475
2013    280.725
2014    296.425
2015    241.775
2016    312.175
dtype: float64
==============================
2012    274.472128
2013    211.128782
2014    221.150739
2015    114.166760
2016    146.548658
dtype: float64

In [57]:
print(df.describe())

               연도        고객 수
count     5.00000    5.000000
mean   2016.20000  220.000000
std       0.83666   57.008771
min    2015.00000  150.000000
25%    2016.00000  200.000000
50%    2016.00000  200.000000
75%    2017.00000  250.000000
max    2017.00000  300.000000

In [10]:
import numpy as np
KTX_data = {'경부선 KTX': [39060, 39896, 42005, 43621, 41702, 41266, 32427],
            '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
            '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
            '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
            '동해선 KTX': [np.nan,np.nan, np.nan, np.nan, 2395, 3786, 6667]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011', '2012', '2013', '2014', '2015', '2016', '2017']

df_KTX = pd.DataFrame(KTX_data, columns = col_list, index = index_list)
print(df_KTX)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [59]:
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [61]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [62]:
df_KTX.head(10)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [ ]:
# index 기준

In [63]:
print(df_KTX[1:2])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN

In [64]:
print(df_KTX[2:5])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [66]:
print(df_KTX.loc['2011'])

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      309.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [69]:
print(type((df_KTX.loc['2011'])))

<class 'pandas.core.series.Series'>

In [71]:
print(df_KTX.loc['2013':'2016'])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [72]:
# col 기준

In [73]:
print(df_KTX['경부선 KTX'])

2011    39060
2012    39896
2013    42005
2014    43621
2015    41702
2016    41266
2017    32427
Name: 경부선 KTX, dtype: int64

In [75]:
print(df_KTX['경부선 KTX']['2012':'2014'])

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [76]:
print(df_KTX['경부선 KTX'][1:4])

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [78]:
print(df_KTX[1:4]['경부선 KTX'])

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [79]:
print(df_KTX[1:3][1:4]) #숫자 indexing은 무조건 row

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     4088     1954      NaN

In [81]:
print(df_KTX[1:3])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [82]:
print(df_KTX[1:3][0:2])

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [83]:
print(df_KTX.loc['2016']['호남선 KTX'])
print('='*40)
print(df_KTX.loc['2016','호남선 KTX'])
print('='*40)
print(df_KTX['호남선 KTX']['2016'])
print('='*40)
print(df_KTX['호남선 KTX'][5])
print('='*40)
print(df_KTX['호남선 KTX'].loc['2016'])

10622.0
========================================
10622
========================================
10622
========================================
10622
========================================
10622

In [86]:
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [87]:
print(df_KTX[['동해선 KTX', '전라선 KTX', '경전선 KTX', '호남선 KTX', '경부선 KTX']])

      동해선 KTX  전라선 KTX  경전선 KTX  호남선 KTX  경부선 KTX
2011      NaN      309     3627     7313    39060
2012      NaN     1771     4168     6967    39896
2013      NaN     1954     4088     6873    42005
2014      NaN     2244     4424     6626    43621
2015   2395.0     3146     4606     8675    41702
2016   3786.0     3945     4984    10622    41266
2017   6667.0     5766     5570     9228    32427

In [89]:
df1 = pd.DataFrame({'Class1': [95, 92, 98, 100],
                'Class2': [91, 93, 97, 99]})
print(df1)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [90]:
df2 = pd.DataFrame({'Class1': [87, 89],
                'Class2': [85, 90]})
print(df2)

   Class1  Class2
0      87      85
1      89      90

In [92]:
df = pd.concat([df1, df2])
df

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [93]:
df = pd.concat([df1, df2], ignore_index = True)
df

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [95]:
df3 = pd.DataFrame({'Class1': [96, 83]})
df3

   Class1
0      96
1      83

In [96]:
df = pd.concat([df2, df3], ignore_index = True)
df

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [98]:
df4 = pd.DataFrame({'Class3': [93, 91, 95, 98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [99]:
df = df1.join(df4) #같은 index 기준 옆으로 붙이기
df

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [100]:
index_label = ['a','b','c','d']
df1a = pd.DataFrame({'Class1': [95, 92, 98, 100],
                    'Class2': [91, 93, 97, 99]}, index= index_label)
df4a = pd.DataFrame({'Class3': [93, 91, 95, 98]}, index=index_label)

print(df1a.join(df4a))

   Class1  Class2  Class3
a      95      91      93
b      92      93      91
c      98      97      95
d     100      99      98

In [102]:
df5 = pd.DataFrame({'Class4': [82, 92]})
df5

   Class4
0      82
1      92

In [103]:
df1.join(df5)

   Class1  Class2  Class4
0      95      91    82.0
1      92      93    92.0
2      98      97     NaN
3     100      99     NaN

In [107]:
df_A_B = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품A': [100, 150, 200, 130],
                   '제품B': [90, 110, 140, 170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [108]:
df_C_D = pd.DataFrame({'판매월': ['1월', '2월', '3월', '4월'],
                       '제품C': [112, 141, 203, 134],
                   '제품D': [90, 110, 140, 170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [109]:
df_A_B.merge(df_C_D) #공통된 값을 기준으로 붙임

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [110]:
df_left = pd.DataFrame({'key':['A','B','C'], 'left': [1, 2, 3]})
df_right = pd.DataFrame({'key':['A','B','D'], 'right': [4, 5, 6]})
print(df_left)
print(df_right)

  key  left
0   A     1
1   B     2
2   C     3
  key  right
0   A      4
1   B      5
2   D      6

In [111]:
df_left.merge(df_right, how='left', on='key') #left기준으로 #on = 공통된 col여러개일 때 기준이 될 col

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [112]:
df_left.merge(df_right, how='right', on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [113]:
df_left.merge(df_right, how='outer', on='key') #양쪽 모두를 다 기준

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [114]:
df_left.merge(df_right, how='inner', on='key') #양쪽 모두 공통된것만

  key  left  right
0   A     1      4
1   B     2      5

In [12]:
data = {'연도': [2015, 2016, 2016, 2017, 2017], 
    '지사': ['서울', '서울', '부산', '서울', '부산'],
        '고객 수': [200, 250, 150, 300, 200]}
df = pd.DataFrame(data, columns=['지사','연도', '고객 수'])
print(df)

print('-' * 20)

data = {'연도': [2018], 
    '지사': ['대전'],
        '고객 수': [500]}

row = pd.DataFrame(data) #, columns=['지사','연도', '고객 수'])

print(row)
print('-' * 20)
df = pd.concat([df, row], ignore_index=True)
print(df)

   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200
--------------------
     연도  지사  고객 수
0  2018  대전   500
--------------------
   지사    연도  고객 수
0  서울  2015   200
1  서울  2016   250
2  부산  2016   150
3  서울  2017   300
4  부산  2017   200
5  대전  2018   500

In [34]:
data = {'연도': [2015, 2016, 2016, 2017, 2017], 
	'지사': ['서울', '서울', '부산', '서울', '부산'],
        '고객 수': [200, 250, 150, 300, 200]}

data['연도'].append(2018)
data['지사'].append('대전')
data['고객 수'].append(500)
  
df = pd.DataFrame(data, index = data['연도'], columns = ['지사', '고객 수'])
print(df)

      지사  고객 수
2015  서울   200
2016  서울   250
2016  부산   150
2017  서울   300
2017  부산   200
2018  대전   500

In [136]:
df = pd.read_csv('data/sea_rain1_from_utf8.csv')
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [140]:
df = pd.read_csv('data/sea_rain1_from_euckr.csv', encoding = 'cp949')
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [3]:
df = pd.read_csv('data/sea_rain1_from_utf8.csv', index_col = '연도')
df

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [4]:
df_WH = pd.DataFrame({'Weight':[62, 67, 55, 74],
                      'Height':[165, 177, 160, 180]},
                       index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])
df_WH.index.name = 'User'

In [5]:
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [6]:
bmi = df_WH['Weight'] / (df_WH['Height'] / 100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [7]:
df_WH['BMI'] = bmi

In [8]:
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [9]:
df_WH.to_csv('data/bmi.csv')

In [10]:
df_WH.to_csv('data/bmi.txt', sep = ' ', encoding = 'cp949') #mac은 utf-8